<template>
  <v-dialog v-model="dialog"
            scrollable
            width="500">
    <template slot="activator">
      <slot></slot>
    </template>
    <v-card>
      <v-card-title class="headline primary white--text"
                    primary-title>
        懒虫动动协议及隐私政策
      </v-card-title>

      <v-card-text class="policy">
        <div class="md-layout-item bg-white">
          <div class="py-3 policy-items caption">
            <div class="title mb-3">用户协议</div>
            <div class="body-2">
              <p>欢迎您使用“懒虫动动”！本协议由您与“懒虫动动”共同缔结，本协议具有法律效力。</p>
              <p>为使用“懒虫动动”以及成都懒虫动动科技有限公司所提供的相关服务（以下统一简称“
                <span class="primary--text">懒虫动动</span>”），您应当阅读并遵守《“懒虫动动”用户协议》（以下简称“本协议”）、根据《中华人民共和国电信条例 》、《互联网信息服务管理办法 》、《互联网电子公告服务管理规定》、《中华人民共和国计算机信息网络国际联网管理暂行规定》、《中华人民共和国计算机信息网络国际联网管理暂行规定实施办法》、《中华人民共和国计算机信息系统安全保护条例 》、《计算机信息网络国际联网安全保护管理办法》等相关协议、国家法律法规。请您务必审慎阅读、充分理解各条款内容，您对“懒虫动动”的登陆、查看、发布信息等行为即视为您已阅读本协议的内容并同意受本协议的约束。</p>
              <p>如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用互联网的相关条款。</p>
            </div>
            <div class="policy-item mb-3">
              <div class="subheading">定义</div>
              <div class="pt-3">
                <p>1、用户，包括注册用户以及非注册用户。注册用户是指通过“懒虫动动”完成全部注册程序后，使用“懒虫动动”服务的用户。非注册用户是指除通过“懒虫动动”完成全部注册程序后使用“懒虫动动”服务的用户。</p>
                <p>2、协议方，本协议中协议双方合称协议方。成都懒虫动动科技有限公司及其关联公司、信息发布平台、所属应用程序等在协议中统称为“懒虫动动”，通过“懒虫动动”、“懒虫动动”官方网站为您提供服务。</p>
              </div>
            </div>
            <div class="policy-item mb-3">
              <div class="subheading">协议与效力</div>
              <div class="pt-3">
                <p>1、在您按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后或以其他“懒虫动动”允许的方式实际使用“懒虫动动”服务时，您即受本协议的约束。在注册时，您应当按照法律法规要求，或注册页面的提示，准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便“懒虫动动”或其他会员与您进行有效联系。如您的资料发生变更，您应及时更新您的资料，以使之真实、及时，完整和准确。否则，“懒虫动动”有理由怀疑您提供的资料错误、不实、过时或不完整，并有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止/终止对您提供部分或全部服务。由此导致您在使用“懒虫动动”服务过程中产生任何损失或增加费用的，应由您完全独自承担。</p>
                <p>2、对于您提供的资料及数据信息，您授予“懒虫动动”独家的、全球通用的、永久的、免费的许可使用权利。您同意，“懒虫动动”有权(全部或部分地)使用、复制、更正、发布、翻译、分发、执行和展示您的资料数据（包括但不限于注册资料、行为数据及全部展示于“懒虫动动”的各类信息）或制作其派生作品，并以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。在此，您特别做出授权，允许“懒虫动动”依据您提供的信息资料及在“懒虫动动”上的行为、投诉及侵权状况等进行信用评级，您对“懒虫动动”的信用评级体系予以认可并同意“懒虫动动”将您在平台存储的全部或部分信息及信用评价结果以有偿或无偿方式提供给第三方进行商业或非商业方式的使用，而无需在该提供行为之前再另行取得您的同意。如您不同意做出前述授权，您应立即停止注册程序或停止使用“懒虫动动”服务。如您继续使用“懒虫动动”服务的，即表示您同意做出前述授权。</p>
                <p>3、您应当在使用“懒虫动动”服务之前认真阅读全部协议内容。如您对协议有任何疑问的，应向“懒虫动动”咨询。但无论您事实上是否在使用“懒虫动动”服务之前认真阅读了本协议内容，只要您使用“懒虫动动”服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得“懒虫动动”对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</p>
                <p>4、本协议内容包括协议正文及所有“懒虫动动”已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何“懒虫动动”及其关联公司提供的服务（以下称为“懒虫动动”服务）均受本协议约束。您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用“懒虫动动”服务。</p>
                <p>5、“懒虫动动”有权根据国家法律法规的更新、产品和服务规则的调整需要不时地制订、修改本协议及/或各类规则，并以网站公示的方式进行公示。如您继续使用“懒虫动动”服务的，即表示您接受经修订的协议和规则。</p>
              </div>
            </div>
            <div class="policy-item mb-3">
              <div class="subheading">注册</div>
              <div class="pt-3">
                <p>1、您确认，在您完成注册程序或以其他“懒虫动动”允许的方式实际使用“懒虫动动”服务时，您应当是具备相应民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且“懒虫动动”有权注销您的账户，并向您及您的监护人索偿。</p>
                <p>2、“懒虫动动”非常重视对青少年个人信息搜集和使用的安全性的保护。“懒虫动动”建议，任何未满18周岁的未成年人参加网上活动应事先取得其监护人（以下简称"监护人"）的同意并遵守《青少年网络文明公约》。</p>
                <p>3、在您签署本协议，完成注册程序时，“懒虫动动”会向您提供唯一编号的“懒虫动动”账户。您应对您的账户和密码的安全，以及对通过您的账户和密码实施的行为负责。除非有法律规定或行政司法机关的指令，且征得“懒虫动动”的同意，否则，账户和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。如果发现任何人不当使用您的账户或有任何其他可能危及您的账户安全的情形时，您应当立即以有效方式通知“懒虫动动”，要求“懒虫动动”暂停相关服务。您理解“懒虫动动”对您的请求采取行动需要合理时间，“懒虫动动”对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。</p>
                <p>4、注册及使用“懒虫动动”的过程中，如您选择进行实名认证并上传个人身份证件及个人头像图片的，由“懒虫动动”对您上传的个人身份证件及个人头像进行常规形式的审核。您同意并理解“懒虫动动”仅能对上传者的行为是否合法正当、个人身份证件是否真实有效进行表面的形式审核，“懒虫动动”没有能力和权限对您提供的实名认证信息进行实质性的审核，“懒虫动动”的审核结果有可能会因您不正当的行为方式出现与实际的事实情况不一致的情形。在此您保证您会严格保管您的“懒虫动动”账户、密码及个人身份证件，并保证不会使用他人或伪造的身份证件用于自身的实名认证，否则由此产生的全部不利责任将全部由您自身承担。</p>
              </div>
            </div>
            <div class="policy-item mb-3">
              <div class="subheading">“懒虫动动”服务使用规范</div>
              <div class="pt-3">
                <div class="body-2 mb-2">通过“懒虫动动”，您可以按照“懒虫动动”的规则发布各种生活信息。但所发布之信息不得含有如下内容：</div>
                <p>1、煽动抗拒、破坏宪法和法律、行政法规实施的。</p>
                <p>2、煽动颠覆国家政权，推翻社会主义制度的。</p>
                <p>3、煽动分裂国家、破坏国家统一的。</p>
                <p>4、煽动民族仇恨、民族歧视，破坏民族团结的。</p>
                <p>5、捏造或者歪曲事实，散布谣言，扰乱社会秩序的。</p>
                <p>6、宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的。</p>
                <p>7、公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的。</p>
                <p>8、损害国家机关信誉的。</p>
                <p>9、其他违反宪法和法律法规的。</p>

                <div class="body-2 mb-2">通过“懒虫动动”，您可以按照“懒虫动动”的规则发布各种生活信息。但所发布之信息必须符合以下条款：</div>

                <p>1、发表、传送、传播、储存侵害他人知识产权、商业秘密权等合法权利的内容，包含病毒、木马、定时炸弹等可能对“懒虫动动”系统造成伤害或影响其稳定性的内容制造虚假身份以误导、欺骗他人。</p>
                <p>2、传送或散布以其他方式实现传送含有受到知识产权法律保护的图像、相片、软件或其他资料的文件，作为举例（但不限于此）：包括版权或商标法（或隐私权或公开权），除非用户拥有或控制着相应的权利或已得到所有必要的认可。</p>
                <p>3、使用任何包含有通过侵犯商标、版权、专利、商业机密或任何一方的其他专有权利的方式利用本“软件”获得的图像或相片的资料或信息。</p>
                <p>4、进行危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/帐号；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏本平台系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP/IP数据包名称或部分名称。</p>
                <p>5、修改或伪造软件作品运行中的指令、数据、数据包，增加、删减、变动软件的功能或运行效果，不得将用于上述用途的软件通过信息网络向公众传播或者运营。</p>
                <p>6、在未经“懒虫动动”书面明确授权前提下，出售、出租、出借、散布、转移或转授权软件和服务或相关的链接或从使用软件和服务或软件和服务的条款中获利，无论以上使用是否为直接经济或金钱收益。</p>
                <p>7、违背“懒虫动动”页面公布之活动规则，包括但不限于发布虚假信息、作弊或通过其他手段进行虚假交易。</p>
                <p>8、您了解并同意，“懒虫动动”有权应政府部门（包括司法及行政部门）的要求，向其提供您在“懒虫动动”填写的注册信息和发布纪录等必要信息。</p>

                <div class="body-2 mb-2">在“懒虫动动”上使用“懒虫动动”服务过程中，您承诺遵守以下约定：</div>

                <p>1、在使用“懒虫动动”服务过程中实施的所有行为均遵守国家法律、法规等规范文件及“懒虫动动”各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保“懒虫动动”免于因此产生任何损失。</p>
                <p>2、不发布国家禁止发布的信息（除非取得合法且足够的许可），不发布涉嫌侵犯他人知识产权或其它合法权益的信息，不发布违背社会公共利益或公共道德、公序良俗的信息，不发布其它涉嫌违法或违反本协议及各类规则的信息。</p>
                <p>3、不对“懒虫动动”上的任何数据作商业性利用，包括但不限于在未经“懒虫动动”事先书面同意的情况下，以复制、传播等任何方式使用“懒虫动动”站上展示的资料。</p>
                <p>4、不使用任何装置、软件或例行程序干预或试图干预“懒虫动动”的正常运作或正在“懒虫动动”上进行的任何活动。您不得采取任何将导致不合理的庞大数据负载加诸“懒虫动动”网络设备的行动。</p>

                <div class="body-2 mb-2">您了解并且同意：</div>

                <p>1、您违反上述承诺时，“懒虫动动”有权依据本协议的约定，做出相应处理或终止向您提供服务，且无须征得您的同意或提前通知予您。</p>
                <p>2、根据相关法令的指定或者“懒虫动动”服务规则的判断，您的行为涉嫌违反法律法规的规定或违反本协议和/或规则的条款的，“懒虫动动”有权采取相应措施，包括但不限于直接屏蔽、删除侵权信息、降低您的信用值或直接停止提供服务。</p>
                <p>3、对于您在“懒虫动动”上实施的行为，包括您未在“懒虫动动”上实施但已经对“懒虫动动”及其用户产生影响的行为，“懒虫动动”有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并据此采取相应的处理措施。如果“懒虫动动”发现或收到他人举报您发布的信息违反本协议约定的，“懒虫动动”有权进行独立判断并采取技术手段予以删除、屏蔽或断开链接。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。同时，“懒虫动动”有权视用户的行为性质，采取包括但不限于限制、暂停或终止您使用“懒虫动动”的全部或部分功能，追究法律责任等措施。</p>
                <p>4、对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保“懒虫动动”免于承担因此产生的损失或增加的费用。</p>
                <p>5、如您涉嫌违反有关法律或者本协议之规定，使“懒虫动动”遭受任何损失，或导致任何第三方损害的，或受到任何行政管理部门的处罚，您应当承担相应的法律责任。赔偿“懒虫动动”因此造成的损失及（或）发生的费用，包括合理的律师费用。</p>
                <p>6、您理解并同意，若您的单向或双向好友(简称“违规用户”)违反本协议等相关协议、规则或相关法规政策的，“懒虫动动”将依照相关协议、规则对违规用户进行处理，由此可能影响您与违规用户之间的信息交流、好友关系、好友动态等数据或您对“懒虫动动”的使用责任范围和责任限制。</p>

              </div>
            </div>
            <div class="policy-item mb-3">
              <div class="subheading">责任范围和责任限制</div>
              <div class="pt-3">
                <p>1、“懒虫动动”负责向您提供“懒虫动动”服务。但“懒虫动动”对“懒虫动动”服务不作任何明示或暗示的保证，包括但不限于“懒虫动动”服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，“懒虫动动”也不对“懒虫动动”服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、稳定性、完整性和及时性作出任何承诺和保证。</p>
                <p>2、“懒虫动动”上的信息系用户自行发布，由于海量信息的存在，且“懒虫动动”无法杜绝可能存在风险和瑕疵。您应谨慎判断确定相关信息的真实性、合法性和有效性，并注意保留相应的证据以利于维权，如若脱离本平台进行沟通、交易，不负任何法律责任。</p>
                <div class="body-2">您同意在发现本网站任何内容不符合法律规定，或不符合本用户协议规定的，您有义务及时通知“懒虫动动”。如果您发现您的个人信息被盗用，或者您的版权或者其他权利被侵害，请将此情况告知“懒虫动动”并同时提供如下信息和材料：</div>
                <p>1、侵犯您权利的信息的网址，编号或其他可以找到该信息的细节。</p>
                <p>2、您是所述的版权或者其他权利的合法拥有者的权利证明。</p>
                <p>3、您的联系方式，包括联系人姓名，地址，电话号码和电子邮件。</p>
                <p>4、您的身份证复印件、营业执照等其他相关资料。</p>

                <p>经审查得到证实的，我们将及时删除相关信息。我们仅接受邮寄、电子邮件或传真方式的书面侵权通知。情况紧急的，您可以通过客服电话先行告知，我们会视情况采取相应措施。</p>

                <div class="body-2">您了解并同意，“懒虫动动”不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿：</div>

                <p>1、使用或未能使用“懒虫动动”服务。</p>
                <p>2、第三方未经批准的使用您的账户或更改您的数据。</p>
                <p>3、通过“懒虫动动”服务购买或获取任何商品、样品、数据、信息等行为或替代行为产生的费用及损失。</p>
                <p>4、您对“懒虫动动”服务的误解。</p>
                <p>5、任何非因“懒虫动动”的原因而引起的与“懒虫动动”服务有关的其它损失。</p>
                <p>6、“懒虫动动”对下列不可抗力行为免责：信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务。</p>
                <p>7、您应当严格遵守本协议及“懒虫动动”发布的其他协议、活动规则，因您违反协议或规则的行为给第三方、或“懒虫动动”造成损失的，您应当承担全部责任。</p>

              </div>
            </div>
            <div class="policy-item mb-3">
              <div class="subheading">协议终止</div>
              <div class="pt-3">
                <p>1、您同意，“懒虫动动”基于平台服务的安全性，有权中止向您提供部分或全部“懒虫动动”服务，暂时冻结您的账户，待安全问题解决后及时恢复，并对中止、冻结及恢复的事实及时通知。如果网站的安全问题是由于您的违法行为引起，“懒虫动动”有终止向您提供部分或全部“懒虫动动”服务，永久冻结（注销）您的帐户，并有权向您对损失进行索赔。</p>
                <p>2、您有权向“懒虫动动”要求注销您的账户，经“懒虫动动”审核同意的，“懒虫动动”注销您的账户，届时，您与“懒虫动动”基于本协议的合同关系即终止。您的账户被注销后，“懒虫动动”没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息，但是有权对您的账户信息做合理的处理。</p>

                <div class="body-2">您同意，您与“懒虫动动”的协议关系终止后，“懒虫动动”仍享有下列权利：</div>

                <p>1、继续保存您未及时删除的注册信息及您使用“懒虫动动”服务期间发布的所有信息。</p>
                <p>2、您在使用“懒虫动动”服务期间存在违法行为或违反本协议和/或规则的行为的，“懒虫动动”仍可依据本协议向您主张权利。</p>
              </div>
            </div>
            <div class="policy-item mb-3">
              <div class="subheading">法律适用、管辖与其他</div>
              <div class="pt-3">
                <p>1、本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定的，则应参照通用国际商业惯例和（或）行业惯例。</p>
                <p>2、除非您已阅读并接受本协议所有条款，否则您无权使用“懒虫动动”。</p>
                <p>3、“懒虫动动”有权在必要时修改本协议条款，以修改后最新的协议为准。您可以在相关页面中查阅最新的协议条款。本协议条款变更后，如果您继续使用“懒虫动动”，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用“懒虫动动”。</p>
                <p>4、因本协议产生之争议，应依照中华人民共和国法律予以处理，并以成都懒虫动动科技有限公司所属辖区法院为第一审管辖法院，按照中华人民共和国法律，因级别管辖的规定无权管辖的，以其辖区上级法院作为第一审管辖法院。</p>
                <p>5、本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
                <p>6、本协议最终解释权由“懒虫动动”所有。</p>
                <p>7、如果您实施了违反协议的行为，“懒虫动动”将保留依法追究法律责任的权利。</p>
              </div>
            </div>
          </div>
        </div>
        <div class="policy-items my-3 caption">
          <div class="title mb-3">隐私条款</div>
          <div class="policy-item">
            <div class="subheading"></div>
            <p>“懒虫动动”将在“懒虫动动”公布并不时修订隐私权政策，隐私权政策构成本协议的有效组成部分。</p>
          </div>
          <div class="policy-item">
            <div class="subheading"></div>
            <p>你知悉并认可：“懒虫动动”可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本网站同等的保护用户隐私的责任，则“懒虫动动”有权将用户的注册资料等提供给该第三方。另外，在不透露单个用户隐私资料的前提下，“懒虫动动”有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
          </div>
          <div class="policy-item">
            <div class="subheading"></div>
            <p>为保护您的个人信息的安全。我们使用各种安全技术和程序来保护您的个人信息不被未经授权的访问、使用或泄漏。对此您表示理解和认同。</p>
          </div>
          <div class="policy-item">
            <div class="subheading"></div>
            <p>“懒虫动动”可能调用您设备的特定信息，这样可以简化记录您的个人信息，当您下次使用“懒虫动动”服务时，系统会自动调出您以前发布或浏览的信息，使您的使用变得更加便捷和高效。</p>
          </div>
          <div class="policy-item">
            <div class="subheading"></div>
            <p>“懒虫动动”可能使用您在“懒虫动动”网站浏览的行为，根据您的兴趣喜好，有可能展现您的兴趣相关的其他网站提供的推广内容。</p>
          </div>
        </div>

      </v-card-text>

      <v-divider></v-divider>

      <v-card-actions>
        <v-layout>
          <v-flex>
            <v-btn color="error"
                   flat
                   block
                   @click="onDisagree">
              不同意
            </v-btn>
          </v-flex>
          <v-flex>
            <v-btn color="primary"
                   flat
                   block
                   @click="onAgree">
              同意
            </v-btn>
          </v-flex>
        </v-layout>
      </v-card-actions>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  data: () => ({
    dialog: false
  }),
  methods: {
    onAgree() {
      this.$emit('agree')
      this.$emit('input', true)
      this.dialog = false
    },
    onDisagree() {
      this.$emit('disagree')
      this.$emit('input', false)
      this.dialog = false
    }
  }
}
</script>

<style lang="scss">
.policy {
  -webkit-overflow-scrolling: touch;
  .policy-items {
    .policy-item {
      counter-increment: counter 1;
      padding: 0 0 0 2rem;
      position: relative;
      .subheading:before {
        content: '0' counter(counter);
        position: absolute;
        left: 0;
        color: $primary;
      }
    }
  }
}
</style>
